src/cf/Catalogs/ПочтовыеЯщики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПочтовыеЯщики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПапки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПочтовыхЯщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыПочтовыхЯщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПочтовыхЯщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправленные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаленные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПочтовыеЯщики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Начальное заполнение

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Входящие";
	Элемент.Наименование = НСтр("ru='Входящие'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ВидПапки = Перечисления.ТипыПочтовыхЯщиков.Входящие;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Отправленные";
	Элемент.Наименование = НСтр("ru='Отправленные'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ВидПапки = Перечисления.ТипыПочтовыхЯщиков.Отправленные;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Удаленные";
	Элемент.Наименование = НСтр("ru='Удаленные'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ВидПапки = Перечисления.ТипыПочтовыхЯщиков.Удаленные;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Черновики";
	Элемент.Наименование = НСтр("ru='Черновики'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ВидПапки = Перечисления.ТипыПочтовыхЯщиков.Черновики;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Спам";
	Элемент.Наименование = НСтр("ru='Спам'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ВидПапки = Перечисления.ТипыПочтовыхЯщиков.Спам;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПочтовыйЯщикПоТипу(ТипПочтовогоЯщика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПочтовыеЯщики.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПочтовыеЯщики КАК ПочтовыеЯщики
	|ГДЕ
	|	ПочтовыеЯщики.ВидПапки = &ТипПочтовогоЯщика";
	Запрос.УстановитьПараметр("ТипПочтовогоЯщика", ТипПочтовогоЯщика);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Справочники.ПочтовыеЯщики.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ДанныеЗапросом() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПочтовыеЯщики.ПометкаУдаления КАК ПометкаУдаления,
		|	ПочтовыеЯщики.Наименование КАК Наименование,
		|	ПочтовыеЯщики.ВидПапки КАК ВидПапки,
		|	ПочтовыеЯщики.Предопределенный КАК Предопределенный,
		|	ПочтовыеЯщики.Код КАК Код
		|ИЗ
		|	Справочник.ПочтовыеЯщики КАК ПочтовыеЯщики";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
